TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_АРМПриемкаПоКачеству/гкс_АРМПриемкаПоКачеству.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_АРМПриемкаПоКачеству</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиЗапретаВскрытияПоНоменклатуре/гкс_НастройкиЗапретаВскрытияПоНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиЗапретаВскрытияПоНоменклатуре</name>
  <resources>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопускКВскрытию</name>
    <type>
      <types>EnumRef.гкс_ДопускиКВскрытиюВагонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЖДСтанция</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НоменклатураКонтроляУдостоверенияКачества/гкс_НоменклатураКонтроляУдостоверенияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НоменклатураКонтроляУдостоверенияКачества</name>
  <comment>Список номенклатур, для которых при приёмке ЖД-транспортом обязательны данные удостоверения качества</comment>
  <resources>
    <name>Контролируется</name>
    <comment>Требуется внесение данных удостоверения качества</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиОтключенияВходногоКонтроляКачества/гкс_НастройкиОтключенияВходногоКонтроляКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиОтключенияВходногоКонтроляКачества</name>
  <resources>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЖДСтанция</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиУсиленногоКонтроляКачества/гкс_НастройкиУсиленногоКонтроляКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиУсиленногоКонтроляКачества</name>
  <resources>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВходногоКонтроля</name>
    <type>
      <types>EnumRef.гкс_ТипыУсиленногоКонтроляКачества</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЖДСтанция</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПравила</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ПараметрыСозданияНастроекУсиленногоКонтроля/гкс_ПараметрыСозданияНастроекУсиленногоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПараметрыСозданияНастроекУсиленногоКонтроля</name>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВходногоКонтроля</name>
    <type>
      <types>EnumRef.гкс_ТипыУсиленногоКонтроляКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_АРМПриемкаПоКачеству/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИнтервалАвтообновления;

&НаКлиенте
Перем ТекущаяАктивнаяСтраница;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизитыФормы();
	Элементы.НастройкиУсиленногоКонтроляКачества.Обновить();
	Элементы.НастройкиОтключенияВходногоКонтроляКачества.Обновить();
	Элементы.НастройкиНоменклатурыКонтроляУдостоверенияКачества.Обновить();
	УстановитьВидимостьДоступность();
	
	ИнициализироватьНастройкиАвтообновления();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
	
	// Подключение автообновления настроек каждую минуту по аналогии
	ИнтервалАвтообновления = 60;
	ПодключитьОбработчикОжидания("АвтообновлениеНастроек", ИнтервалАвтообновления, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборАктивностьПриИзменении(Элемент)
	УправлениеФормой();
	ПрименитьФильтрАктивностиДляАктивнойСтраницы();
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	УправлениеФормой(); 
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПЛКПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНастройкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущаяАктивнаяСтраница = ТекущаяСтраница;
	
	ПрименитьФильтрАктивностиДляАктивнойСтраницы();
	
	ОтключитьОбработчикОжидания("АвтообновлениеНастроек");
	ПодключитьОбработчикОжидания("АвтообновлениеНастроек", ИнтервалАвтообновления, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиЗапретаВскрытияПоНоменклатуре

&НаКлиенте
Процедура НастройкиЗапретаВскрытияПоНоменклатуреВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.НастройкиЗапретаВскрытияПоНоменклатуре.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КлючЗаписи = ПолучитьКлючЗаписиЗапретаВскрытияПоНоменклатуре(
		ТекущиеДанные.Номенклатура, ТекущиеДанные.ДопускКВскрытию, ТекущиеДанные.ДатаНачала,
		ТекущиеДанные.ВидПеревозки, ТекущиеДанные.ЖДСтанция,
		ТекущиеДанные.ТранспортноеСредство, ТекущиеДанные.Поставщик);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	ПараметрыФормы.Вставить("ОткрытаИзОбработки", Истина);

	ОткрытьФорму("РегистрСведений.гкс_НастройкиЗапретаВскрытияПоНоменклатуре.ФормаЗаписи",
		ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, Неопределено, Неопределено,
		ОписаниеОповещенияОЗакрытииЗапретаВскрытияПоНоменклатуре(),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиНоменклатурыКонтроляУдостоверенияКачества
&НаКлиенте
Процедура НастройкиНоменклатурыКонтроляУдостоверенияКачестваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.НастройкиНоменклатурыКонтроляУдостоверенияКачества.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КлючЗаписи = ПолучитьКлючЗаписиНоменклатурыКонтроляУдостоверенияКачества(ТекущиеДанные.Номенклатура);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	ПараметрыФормы.Вставить("ОткрытаИзОбработки", Истина);

	ОткрытьФорму("РегистрСведений.гкс_НоменклатураКонтроляУдостоверенияКачества.ФормаЗаписи",
		ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, Неопределено, Неопределено,
		ОписаниеОповещенияОЗакрытииНоменклатурыКонтроляУдостоверенияКачества(),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиУсиленногоКонтроляКачества
&НаКлиенте
Процедура НастройкиУсиленногоКонтроляКачестваПередУдалением(Элемент, Отказ)
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Удаление правила запрещено. Необходимо снять активность.'"), , , , Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтключенияВходногоКонтроля(Команда)
	ПараметрыОткрытия = 
		Новый Структура("ВидПеревозки, ТочкаМаршрута, ОткрытаИзОбработки", 
			ОтборВидПеревозки, Объект.ТочкаМаршрута, Истина);

	ОткрытьФорму("РегистрСведений.гкс_НастройкиОтключенияВходногоКонтроляКачества.ФормаЗаписи", ПараметрыОткрытия,
		ЭтотОбъект, УникальныйИдентификатор, Неопределено, Неопределено,
		ОписаниеОповещенияОЗакрытииОтключенияВходногоКонтроля(), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОтключенияВходногоКонтроля(Команда)
	УправлениеФормой();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписокНастройкиНоменклатурыКонтроляУдостоверенияКачества(Команда)
	ОбновитьНастройкиНоменклатурыКонтроляУдостоверенияКачества();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуНоменклатурыКонтроляУдостоверенияКачества(Команда)
	ПараметрыОткрытия = 
		Новый Структура("ВидПеревозки, ТочкаМаршрута, ОткрытаИзОбработки", 
			ОтборВидПеревозки, Объект.ТочкаМаршрута, Истина);

	ОткрытьФорму("РегистрСведений.гкс_НоменклатураКонтроляУдостоверенияКачества.ФормаЗаписи", ПараметрыОткрытия,
		ЭтотОбъект, УникальныйИдентификатор, Неопределено, Неопределено, 
		ОписаниеОповещенияОЗакрытииНоменклатурыКонтроляУдостоверенияКачества(), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройкуНоменклатурыКонтроляУдостоверенияКачества(Команда)
	ТекущиеДанные = Элементы.НастройкиНоменклатурыКонтроляУдостоверенияКачества.ТекущиеДанные;
	УдалитьНастройкуНоменклатурыКонтроляУдостоверенияКачестваНаСервере(ТекущиеДанные);
	ОбновитьНастройкиНоменклатурыКонтроляУдостоверенияКачества();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗапретаВскрытияПоНоменклатуре(Команда)
	ОбновитьНастройкиЗапретаВскрытияПоНоменклатуре();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗапретВскрытияПоНоменклатуре(Команда)
	ПараметрыОткрытия = Новый Структура("ВидПеревозки, ОткрытаИзОбработки", ОтборВидПеревозки, Истина);

	ОткрытьФорму("РегистрСведений.гкс_НастройкиЗапретаВскрытияПоНоменклатуре.ФормаЗаписи",
		ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, Неопределено, Неопределено,
		ОписаниеОповещенияОЗакрытииЗапретаВскрытияПоНоменклатуре(),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройкуЗапретаВскрытияПоНоменклатуре(Команда)
	ТекущиеДанные = Элементы.НастройкиЗапретаВскрытияПоНоменклатуре.ТекущиеДанные;
	УдалитьНастройкуЗапретаВскрытияПоНоменклатуреНаСервере(ТекущиеДанные);
	ОбновитьНастройкиЗапретаВскрытияПоНоменклатуре();
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	ОтборАктивность = Истина;
	ОтборВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль;
	ИнициализироватьОтборТочкаМаршрута();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	Если ЗначениеЗаполнено(Объект.ТочкаМаршрута) 
		И ЗначениеЗаполнено(ОтборВидПеревозки) Тогда
		УстановитьПараметрыДинамическихСписков();
		Элементы.НастройкиУсиленногоКонтроляКачества.Обновить();
	КонецЕсли;
	
	УправлениеФормойОтключенияВходногоКонтроля();
КонецПроцедуры	

&НаКлиенте
Процедура УправлениеФормойОтключенияВходногоКонтроля()
	Если ЗначениеЗаполнено(Объект.ТочкаМаршрута) 
		И ЗначениеЗаполнено(ОтборВидПеревозки) Тогда
		УстановитьПараметрыДинамическихСписковОтключенияВходногоКонтроля();
		Элементы.НастройкиОтключенияВходногоКонтроляКачества.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОтборТочкаМаршрута()
	
	ИспользоватьНесколькоАЛЦ = ПолучитьФункциональнуюОпцию("гкс_ИспользоватьНесколькоАЛЦ");
	
	Элементы.ОтборТочкаМаршрута.Доступность = ИспользоватьНесколькоАЛЦ;
	Элементы.ОтборТочкаМаршрута.РежимВыбораИзСписка = ИспользоватьНесколькоАЛЦ;
	
	АЛЦПользователя = Новый Массив;
	Объект.ТочкаМаршрута = 
		гкс_ПриемкаТранспорта.ПЛКизНастроекБазыПользователя(ИспользоватьНесколькоАЛЦ, АЛЦПользователя);
	Если ИспользоватьНесколькоАЛЦ
		И ЗначениеЗаполнено(АЛЦПользователя) Тогда
		СписокВыбора = Элементы.ОтборТочкаМаршрута.СписокВыбора;
		СписокВыбора.ЗагрузитьЗначения(АЛЦПользователя);
	КонецЕсли;	
  	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыДинамическихСписков()
	
	Если ЗначениеЗаполнено(ОтборВидПеревозки) Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиУсиленногоКонтроляКачества,
			"ВидПеревозки", ОтборВидПеревозки);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиУсиленногоКонтроляКачества,
			"ТочкаМаршрута", Объект.ТочкаМаршрута);
										
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиУсиленногоКонтроляКачества,
			"Активен", ОтборАктивность);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиУсиленногоКонтроляКачества,
			"ПроизводственныеСутки", ПроизводственныеСуткиПоДате());
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыДинамическихСписковОтключенияВходногоКонтроля()
	
	Если ЗначениеЗаполнено(ОтборВидПеревозки) Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиОтключенияВходногоКонтроляКачества,
			"ВидПеревозки", ОтборВидПеревозки);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиОтключенияВходногоКонтроляКачества,
			"ТочкаМаршрута", Объект.ТочкаМаршрута);
										
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиОтключенияВходногоКонтроляКачества,
			"Активен", ОтборАктивность);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НастройкиОтключенияВходногоКонтроляКачества,
			"ПроизводственныеСутки", ПроизводственныеСуткиПоДате());
		
	КонецЕсли;
		
КонецПроцедуры
 
&НаКлиенте
Функция ОписаниеОповещенияОЗакрытииОтключенияВходногоКонтроля()
	Возврат Новый ОписаниеОповещения("ПослеЗакрытияФормыЗаписиОтключенияВходногоКонтроля", ЭтотОбъект);
КонецФункции
 
&НаКлиенте
Процедура ПослеЗакрытияФормыЗаписиОтключенияВходногоКонтроля(Результат, ДопПараметры) Экспорт
	УправлениеФормойОтключенияВходногоКонтроля();
КонецПроцедуры
 

&НаСервереБезКонтекста
Функция ПроизводственныеСуткиПоДате() 
	Возврат
		гкс_ПриемкаТранспорта.ПроизводственныеСуткиПоДата(ТекущаяДатаСеанса());
КонецФункции		

&НаСервере
Процедура УстановитьВидимостьДоступность()
	ЭтоЖД = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЭтоЖДПеревозка(ОтборВидПеревозки);
	Элементы.НастройкиУсиленногоКонтроляКачестваЖДСтанцияНаименование.Видимость = ЭтоЖД;
	Элементы.НастройкиУсиленногоКонтроляКачестваПунктПогрузки.Видимость = Не ЭтоЖД;
	
	ДоступностьРедактирования = Пользователи.РолиДоступны("гкс_НастройкаУсиленногоКонтроля");
	Элементы.НастройкиУсиленногоКонтроляКачестваСоздать.Доступность = ДоступностьРедактирования;
	Элементы.НастройкиУсиленногоКонтроляКачества.ТолькоПросмотр = Не ДоступностьРедактирования;
	
	ИспользоватьОтключениеВходногоКонтроля 
		= ПолучитьФункциональнуюОпцию("гкс_ИспользоватьОтключениеВходногоКонтроляКачества");
	Элементы.ГруппаОтключенияВходногоКонтроля.Видимость = ИспользоватьОтключениеВходногоКонтроля;
	Элементы.ГруппаУдостоверенияКачества.Видимость = ЭтоЖД;
	Элементы.ГруппаЗапретаВскрытияПоНоменклатуре.Видимость = ЭтоЖД;
	
	Если ИспользоватьОтключениеВходногоКонтроля Тогда
		Элементы.НастройкиОтключенияВходногоКонтроляКачестваЖДСтанция.Видимость = ЭтоЖД;
		Элементы.НастройкиОтключенияВходногоКонтроляКачестваПунктПогрузки.Видимость = Не ЭтоЖД;
		
		Элементы.НастройкиОтключенияВходногоКонтроляКачестваСоздатьОтключенияВходногоКонтроля.Доступность 
			= ДоступностьРедактирования;
		Элементы.НастройкиОтключенияВходногоКонтроляКачества.ТолькоПросмотр = Не ДоступностьРедактирования;
	КонецЕсли;
	
	ИспользоватьАвтоУстановкуЗапретаВскрытия
		= ПолучитьФункциональнуюОпцию("гкс_ИспользоватьАвтоустановкуЗапретаВскрытия");
	Элементы.ГруппаЗапретаВскрытияПоНоменклатуре.Видимость = ИспользоватьАвтоУстановкуЗапретаВскрытия;
	
КонецПроцедуры	

&НаСервере
Процедура ИнициализироватьНастройкиАвтообновления()
	
	// Инициализация соответствий страниц и списков настроек
	// для автоматического обновления настроек активной страницы
	
	// Установка начальных параметров для фильтрации активности
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		НастройкиУсиленногоКонтроляКачества, "Активен", ОтборАктивность);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		НастройкиОтключенияВходногоКонтроляКачества, "Активен", ОтборАктивность);
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)                                                            
	
	ПараметрыОткрытия = Новый Структура("ВидПеревозки, ТочкаМаршрута, ОткрытаИзОбработки", 
			ОтборВидПеревозки, Объект.ТочкаМаршрута, Истина);

		
	ОткрытьФорму("РегистрСведений.гкс_НастройкиУсиленногоКонтроляКачества.ФормаЗаписи", 
					ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, Неопределено, Неопределено,
					ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#Область СлужебныеПроцедурыИФункцииAвтообновления

// Процедура автообновления настроек активной страницы
&НаКлиенте
Процедура АвтообновлениеНастроек()
	
	АктивнаяСтраница = Элементы.ГруппаНастройки.ТекущаяСтраница;
	
	Если АктивнаяСтраница = Элементы.ГруппаУсиленныйКонтроль Тогда
		Элементы.НастройкиУсиленногоКонтроляКачества.Обновить();
	ИначеЕсли АктивнаяСтраница = Элементы.ГруппаОтключенияВходногоКонтроля Тогда
		Элементы.НастройкиОтключенияВходногоКонтроляКачества.Обновить();
	КонецЕсли;
	
	ПрименитьФильтрАктивностиДляАктивнойСтраницы();
	
КонецПроцедуры

// Процедура применения фильтра активности для активной страницы  
&НаКлиенте  
Процедура ПрименитьФильтрАктивностиДляАктивнойСтраницы()
	
	АктивнаяСтраница = Элементы.ГруппаНастройки.ТекущаяСтраница;
	
	Если АктивнаяСтраница = Элементы.ГруппаУсиленныйКонтроль Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			НастройкиУсиленногоКонтроляКачества, "Активен", ОтборАктивность);
	ИначеЕсли АктивнаяСтраница = Элементы.ГруппаОтключенияВходногоКонтроля Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			НастройкиОтключенияВходногоКонтроляКачества, "Активен", ОтборАктивность);
	ИначеЕсли АктивнаяСтраница = Элементы.ГруппаЗапретаВскрытияПоНоменклатуре Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			НастройкиЗапретаВскрытияПоНоменклатуре, "Активен", ОтборАктивность);
	ИначеЕсли АктивнаяСтраница = Элементы.ГруппаУдостоверенияКачества Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			НастройкиНоменклатурыКонтроляУдостоверенияКачества, "Активен", ОтборАктивность);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуУК(Команда)
	ОткрытьФорму("Справочник.гкс_ПараметрыСозданияНастроекУсиленногоКонтроля.ФормаСписка");
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УдалитьНастройкуНоменклатурыКонтроляУдостоверенияКачестваНаСервере(ТекущиеДанные)
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.гкс_НоменклатураКонтроляУдостоверенияКачества.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(ТекущиеДанные.Номенклатура);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойЗапретаВскрытияПоНоменклатуре()
    ОбновитьНастройкиЗапретаВскрытияПоНоменклатуре();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиЗапретаВскрытияПоНоменклатуре()
	Элементы.НастройкиЗапретаВскрытияПоНоменклатуре.Обновить();	
КонецПроцедуры	

&НаКлиенте
Функция ОписаниеОповещенияОЗакрытииЗапретаВскрытияПоНоменклатуре()
	Возврат Новый ОписаниеОповещения("ПослеЗакрытияФормыЗаписиЗапретаВскрытияПоНоменклатуре", ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыЗаписиЗапретаВскрытияПоНоменклатуре(Результат, ДопПараметры) Экспорт
	УправлениеФормойЗапретаВскрытияПоНоменклатуре();
КонецПроцедуры

&НаСервере
Процедура УдалитьНастройкуЗапретаВскрытияПоНоменклатуреНаСервере(ТекущиеДанные)
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.гкс_НастройкиЗапретаВскрытияПоНоменклатуре.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(ТекущиеДанные.Номенклатура);
	НаборЗаписей.Отбор.ДопускКВскрытию.Установить(ТекущиеДанные.ДопускКВскрытию);
	НаборЗаписей.Отбор.ДатаНачала.Установить(ТекущиеДанные.ДатаНачала);
	НаборЗаписей.Отбор.ВидПеревозки.Установить(ТекущиеДанные.ВидПеревозки);
	НаборЗаписей.Отбор.ЖДСтанция.Установить(ТекущиеДанные.ЖДСтанция);
	НаборЗаписей.Отбор.ТранспортноеСредство.Установить(ТекущиеДанные.ТранспортноеСредство);
	НаборЗаписей.Отбор.Поставщик.Установить(ТекущиеДанные.Поставщик);
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиЗапретаВскрытияПоНоменклатуре(Номенклатура, ДопускКВскрытию, ДатаНачала, ВидПеревозки, ЖДСтанция, ТранспортноеСредство, Поставщик)
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Номенклатура", Номенклатура);
	СтруктураКлюча.Вставить("ДопускКВскрытию", ДопускКВскрытию);
	СтруктураКлюча.Вставить("ДатаНачала", ДатаНачала);
	СтруктураКлюча.Вставить("ВидПеревозки", ВидПеревозки);
	СтруктураКлюча.Вставить("ЖДСтанция", ЖДСтанция);
	СтруктураКлюча.Вставить("ТранспортноеСредство", ТранспортноеСредство);
	СтруктураКлюча.Вставить("Поставщик", Поставщик);
	Возврат РегистрыСведений.гкс_НастройкиЗапретаВскрытияПоНоменклатуре.СоздатьКлючЗаписи(СтруктураКлюча);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиНоменклатурыКонтроляУдостоверенияКачества(Номенклатура)
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Номенклатура", Номенклатура);
	Возврат РегистрыСведений.гкс_НоменклатураКонтроляУдостоверенияКачества.СоздатьКлючЗаписи(СтруктураКлюча);
КонецФункции

&НаКлиенте
Функция ОписаниеОповещенияОЗакрытииНоменклатурыКонтроляУдостоверенияКачества()
	Возврат Новый ОписаниеОповещения("ПослеЗакрытияФормыЗаписиНоменклатурыКонтроляУдостоверенияКачества", ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыЗаписиНоменклатурыКонтроляУдостоверенияКачества(Результат, ДопПараметры) Экспорт
	УправлениеФормойНоменклатурыКонтроляУдостоверенияКачества();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойНоменклатурыКонтроляУдостоверенияКачества()
    ОбновитьНастройкиНоменклатурыКонтроляУдостоверенияКачества();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиНоменклатурыКонтроляУдостоверенияКачества()
	Элементы.НастройкиНоменклатурыКонтроляУдостоверенияКачества.Обновить();	
КонецПроцедуры	

#КонецОбласти
